print ("Шляпка гриба, покрытая кожиц.й, держится на .. ножн.. Снизу шляпка затянута .. пленкой. Когда ее уберешь, откроется нижняя .. сторона шляпк..")

a = input ("вставьте первую букву ")
b = input ("вставьте второе слово ")
c = input ("вставьте третью букву")
d = input ("вставьте четвертое слово")
e = input ("вставьте пятое слово")
f = input ("вставьте 6 слово")

print (f"Шляпка гриба, покрытая кожиw{a}й, держится на {b} ножн{c} Снизу шляпка затянута {d} пленкой. Когда ее уберешь, откроется нижняя {e} сторона шляпк{f}.")